tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1719_tdd.h
#define G1BLKF3                       1091
#define G1BLKF4                       1092
#define G1BLKF5                       1093
#define COG1DBR                       1094
#define G1DBR0                        1095
#define G1DBR                         1096
#define G1DBR1                        1097
#define G1DBR2                        1098
#define G1DBR3                        1099
#define G1DBR4                        1100
#define G1DBR5                        1101
#define COG1DBF                       1102
#define G1DBF0                        1103
#define G1DBF                         1104
#define G1DBF1                        1105
#define G1DBF2                        1106
#define G1DBF3                        1107
#define G1DBF4                        1108
#define G1DBF5                        1109
#define COG1CON0                      1110
#define G1MD0                         1111
#define G1MD                          1112
#define G1MD1                         1113
#define G1MD2                         1114
#define G1CS0                         1115
#define G1CS                          1116
#define G1CS1                         1117
#define G1LD                          1118
#define G1EN                          1119
#define COG1CON1                      1120
#define G1POLA                        1121
#define G1POLB                        1122
#define G1POLC                        1123
#define G1POLD                        1124
#define G1FDBS                        1125
#define G1RDBS                        1126
#define COG1RIS                       1127
#define G1RIS0                        1128
#define G1RIS1                        1129
#define G1RIS2                        1130
#define G1RIS3                        1131
#define G1RIS4                        1132
#define G1RIS5                        1133
#define G1RIS6                        1134
#define G1RIS7                        1135
#define COG1RSIM                      1136
#define G1RSIM0                       1137
#define G1RSIM1                       1138
#define G1RSIM2                       1139
#define G1RSIM3                       1140
#define G1RSIM4                       1141
#define G1RSIM5                       1142
#define G1RSIM6                       1143
#define G1RSIM7                       1144
#define COG1FIS                       1145
#define G1FIS0                        1146
#define G1FIS1                        1147
#define G1FIS2                        1148
#define G1FIS3                        1149
#define G1FIS4                        1150
#define G1FIS5                        1151
#define G1FIS6                        1152
#define G1FIS7                        1153
#define COG1FSIM                      1154
#define G1FSIM0                       1155
#define G1FSIM1                       1156
#define G1FSIM2                       1157
#define G1FSIM3                       1158
#define G1FSIM4                       1159
#define G1FSIM5                       1160
#define G1FSIM6                       1161
#define G1FSIM7                       1162
#define COG1ASD0                      1163
#define G1ASDAC0                      1164
#define G1ASDAC                       1165
#define G1ASDAC1                      1166
#define G1ASDBD0                      1167
#define G1ASDBD                       1168
#define G1ASDBD1                      1169
#define G1ARSEN                       1170
#define G1ASE                         1171
#define COG1ASD1                      1172
#define G1AS0E                        1173
#define G1AS1E                        1174
#define G1AS2E                        1175
#define G1AS3E                        1176
#define COG1STR                       1177
#define G1STRA                        1178
#define G1STRB                        1179
#define G1STRC                        1180
#define G1STRD                        1181
#define G1SDATA                       1182
#define G1SDATB                       1183
#define G1SDATC                       1184
#define G1SDATD                       1185
#define PPSLOCK                       1186
#define PPSLOCKED                     1187
#define INTPPS                        1188
#define T0CKIPPS                      1189
#define T1CKIPPS                      1190
#define T1GPPS                        1191
#define CCP1PPS                       1192
#define CCP2PPS                       1193
#define COGINPPS                      1194
#define SSPCLKPPS                     1195
#define SSPDATPPS                     1196
#define SSPSSPPS                      1197
#define RXPPS                         1198
#define CKPPS                         1199
#define CLCIN0PPS                     1200
#define CLCIN1PPS                     1201
#define CLCIN2PPS                     1202
#define CLCIN3PPS                     1203
#define RA0PPS                        1204
#define RA1PPS                        1205
#define RA2PPS                        1206
#define RA3PPS                        1207
#define RA4PPS                        1208
#define RA5PPS                        1209
#define RA6PPS                        1210
#define RA7PPS                        1211
#define RB0PPS                        1212
#define RB1PPS                        1213
#define RB2PPS                        1214
#define RB3PPS                        1215
#define RB4PPS                        1216
#define RB5PPS                        1217
#define RB6PPS                        1218
#define RB7PPS                        1219
#define RC0PPS                        1220
#define RC1PPS                        1221
#define RC2PPS                        1222
#define RC3PPS                        1223
#define RC4PPS                        1224
#define RC5PPS                        1225
#define RC6PPS                        1226
#define RC7PPS                        1227
#define RD0PPS                        1228
#define RD1PPS                        1229
#define RD2PPS                        1230
#define RD3PPS                        1231
#define RD4PPS                        1232
#define RD5PPS                        1233
#define RD6PPS                        1234
#define RD7PPS                        1235
#define RE0PPS                        1236
#define RE1PPS                        1237
#define RE2PPS                        1238
#define CLCDATA                       1239
#define MCLC1OUT                      1240
#define MLC1OUT                       1241
#define MCLC2OUT                      1242
#define MLC2OUT                       1243
#define MLC3OUT                       1244
#define MCLC3OUT                      1245
#define MLC4OUT                       1246
#define MCLC4OUT                      1247
#define CLC1CON                       1248
#define CLC1CON_MODE                  1249
#define LC1MODE0                      1250
#define LC1MODE                       1251
#define CLC1CON_MODE0                 1252
#define LC1MODE1                      1253
#define CLC1CON_MODE1                 1254
#define CLC1CON_MODE2                 1255
#define LC1MODE2                      1256
#define LC1INTN                       1257
#define CLC1CON_INTN                  1258
#define LC1INTP                       1259
#define CLC1CON_INTP                  1260
#define CLC1CON_OUT                   1261
#define LC1OUT                        1262
#define LC1EN                         1263
#define CLC1CON_EN                    1264
#define CLC1POL                       1265
#define LC1G1POL                      1266
#define CLC1POL_G1POL                 1267
#define CLC1POL_G2POL                 1268
#define LC1G2POL                      1269
#define LC1G3POL                      1270
#define CLC1POL_G3POL                 1271
#define LC1G4POL                      1272
#define CLC1POL_G4POL                 1273
#define CLC1POL_POL                   1274
#define LC1POL                        1275
#define CLC1SEL0                      1276
#define CLC1SEL0_D1S0                 1277
#define LC1D1S                        1278
#define LC1D1S0                       1279
#define CLC1SEL0_D1S                  1280
#define CLC1SEL0_D1S1                 1281
#define LC1D1S1                       1282
#define CLC1SEL0_D1S2                 1283
#define LC1D1S2                       1284
#define CLC1SEL0_D1S3                 1285
#define LC1D1S3                       1286
#define CLC1SEL0_D1S4                 1287
#define LC1D1S4                       1288
#define CLC1SEL1                      1289
#define CLC1SEL1_D2S0                 1290
#define CLC1SEL1_D2S                  1291
#define LC1D2S                        1292
#define LC1D2S0                       1293
#define CLC1SEL1_D2S1                 1294
#define LC1D2S1                       1295
#define LC1D2S2                       1296
#define CLC1SEL1_D2S2                 1297
#define LC1D2S3                       1298
#define CLC1SEL1_D2S3                 1299
#define LC1D2S4                       1300
#define CLC1SEL1_D2S4                 1301
#define CLC1SEL2                      1302
#define LC1D3S0                       1303
#define CLC1SEL2_D3S                  1304
#define LC1D3S                        1305
#define CLC1SEL2_D3S0                 1306
#define LC1D3S1                       1307
#define CLC1SEL2_D3S1                 1308
#define LC1D3S2                       1309
#define CLC1SEL2_D3S2                 1310
#define LC1D3S3                       1311
#define CLC1SEL2_D3S3                 1312
#define LC1D3S4                       1313
#define CLC1SEL2_D3S4                 1314
#define CLC1SEL3                      1315
#define CLC1SEL3_D4S                  1316
#define LC1D4S                        1317
#define LC1D4S0                       1318
#define CLC1SEL3_D4S0                 1319
#define CLC1SEL3_D4S1                 1320
#define LC1D4S1                       1321
#define LC1D4S2                       1322
#define CLC1SEL3_D4S2                 1323
#define LC1D4S3                       1324
#define CLC1SEL3_D4S3                 1325
#define LC1D4S4                       1326
#define CLC1SEL3_D4S4                 1327
#define CLC1GLS0                      1328
#define CLC1GLS0_D1N                  1329
#define LC1G1D1N                      1330
#define CLC1GLS0_D1T                  1331
#define LC1G1D1T                      1332
#define LC1G1D2N                      1333
#define CLC1GLS0_D2N                  1334
#define LC1G1D2T                      1335
#define CLC1GLS0_D2T                  1336
#define CLC1GLS0_D3N                  1337
#define LC1G1D3N                      1338
#define CLC1GLS0_D3T                  1339
#define LC1G1D3T                      1340
#define CLC1GLS0_D4N                  1341
#define LC1G1D4N                      1342
#define CLC1GLS0_D4T                  1343
#define LC1G1D4T                      1344
#define CLC1GLS1                      1345
#define CLC1GLS1_D1N                  1346
#define LC1G2D1N                      1347
#define LC1G2D1T                      1348
#define CLC1GLS1_D1T                  1349
#define CLC1GLS1_D2N                  1350
#define LC1G2D2N                      1351
#define LC1G2D2T                      1352
#define CLC1GLS1_D2T                  1353
#define CLC1GLS1_D3N                  1354
#define LC1G2D3N                      1355
#define LC1G2D3T                      1356
#define CLC1GLS1_D3T                  1357
#define CLC1GLS1_D4N                  1358
#define LC1G2D4N                      1359
#define LC1G2D4T                      1360
#define CLC1GLS1_D4T                  1361
#define CLC1GLS2                      1362
#define CLC1GLS2_D1N                  1363
#define LC1G3D1N                      1364
#define LC1G3D1T                      1365
#define CLC1GLS2_D1T                  1366
#define LC1G3D2N                      1367
#define CLC1GLS2_D2N                  1368
#define LC1G3D2T                      1369
#define CLC1GLS2_D2T                  1370
#define CLC1GLS2_D3N                  1371
#define LC1G3D3N                      1372
#define LC1G3D3T                      1373
#define CLC1GLS2_D3T                  1374
#define LC1G3D4N                      1375
#define CLC1GLS2_D4N                  1376
#define LC1G3D4T                      1377
#define CLC1GLS2_D4T                  1378
#define CLC1GLS3                      1379
#define LC1G4D1N                      1380
#define CLC1GLS3_G4D1N                1381
#define LC1G4D1T                      1382
#define CLC1GLS3_G4D1T                1383
#define CLC1GLS3_G4D2N                1384
#define LC1G4D2N                      1385
#define CLC1GLS3_G4D2T                1386
#define LC1G4D2T                      1387
#define LC1G4D3N                      1388
#define CLC1GLS3_G4D3N                1389
#define LC1G4D3T                      1390
#define CLC1GLS3_G4D3T                1391
#define CLC1GLS3_G4D4N                1392
#define LC1G4D4N                      1393
#define CLC1GLS3_G4D4T                1394
#define LC1G4D4T                      1395
#define CLC2CON                       1396
#define LC2MODE0                      1397
#define CLC2CON_MODE                  1398
#define LC2MODE                       1399
#define CLC2CON_MODE0                 1400
#define LC2MODE1                      1401
#define CLC2CON_MODE1                 1402
#define LC2MODE2                      1403
#define CLC2CON_MODE2                 1404
#define LC2INTN                       1405
#define CLC2CON_INTN                  1406
#define LC2INTP                       1407
#define CLC2CON_INTP                  1408
#define CLC2CON_OUT                   1409
#define LC2OUT                        1410
#define CLC2CON_EN                    1411
#define LC2EN                         1412
#define CLC2POL                       1413
#define LC2G1POL                      1414
#define CLC2POL_G1POL                 1415
#define LC2G2POL                      1416
#define CLC2POL_G2POL                 1417
#define LC2G3POL                      1418
#define CLC2POL_G3POL                 1419
#define LC2G4POL                      1420
#define CLC2POL_G4POL                 1421
#define CLC2POL_POL                   1422
#define LC2POL                        1423
#define CLC2SEL0                      1424
#define CLC2SEL0_D1S                  1425
#define LC2D1S0                       1426
#define CLC2SEL0_D1S0                 1427
#define LC2D1S                        1428
#define LC2D1S1                       1429
#define CLC2SEL0_D1S1                 1430
#define LC2D1S2                       1431
#define CLC2SEL0_D1S2                 1432
#define CLC2SEL0_D1S3                 1433
#define LC2D1S3                       1434
#define LC2D1S4                       1435
#define CLC2SEL0_D1S4                 1436
#define CLC2SEL1                      1437
#define LC2D2S0                       1438
#define CLC2SEL1_D2S0                 1439
#define LC2D2S                        1440
#define CLC2SEL1_D2S                  1441
#define LC2D2S1                       1442
#define CLC2SEL1_D2S1                 1443
#define LC2D2S2                       1444
#define CLC2SEL1_D2S2                 1445
#define LC2D2S3                       1446
#define CLC2SEL1_D2S3                 1447
#define LC2D2S4                       1448
#define CLC2SEL1_D2S4                 1449
#define CLC2SEL2                      1450
#define CLC2SEL2_D3S                  1451
#define LC2D3S0                       1452
#define CLC2SEL2_D3S0                 1453
#define LC2D3S                        1454
#define CLC2SEL2_D3S1                 1455
#define LC2D3S1                       1456
#define LC2D3S2                       1457
#define CLC2SEL2_D3S2                 1458
#define LC2D3S3                       1459
#define CLC2SEL2_D3S3                 1460
#define LC2D3S4                       1461
#define CLC2SEL2_D3S4                 1462
#define CLC2SEL3                      1463
#define LC2D4S                        1464
#define LC2D4S0                       1465
#define CLC2SEL3_D4S                  1466
#define CLC2SEL3_D4S0                 1467
#define LC2D4S1                       1468
#define CLC2SEL3_D4S1                 1469
#define LC2D4S2                       1470
#define CLC2SEL3_D4S2                 1471
#define CLC2SEL3_D4S3                 1472
#define LC2D4S3                       1473
#define LC2D4S4                       1474
#define CLC2SEL3_D4S4                 1475
#define CLC2GLS0                      1476
#define LC2G1D1N                      1477
#define CLC2GLS0_D1N                  1478
#define CLC2GLS0_D1T                  1479
#define LC2G1D1T                      1480
#define LC2G1D2N                      1481
#define CLC2GLS0_D2N                  1482
#define CLC2GLS0_D2T                  1483
#define LC2G1D2T                      1484
#define LC2G1D3N                      1485
#define CLC2GLS0_D3N                  1486
#define CLC2GLS0_D3T                  1487
#define LC2G1D3T                      1488
#define LC2G1D4N                      1489
#define CLC2GLS0_D4N                  1490
#define CLC2GLS0_D4T                  1491
#define LC2G1D4T                      1492
#define CLC2GLS1                      1493
#define CLC2GLS1_D1N                  1494
#define LC2G2D1N                      1495
#define CLC2GLS1_D1T                  1496
#define LC2G2D1T                      1497
#define CLC2GLS1_D2N                  1498
#define LC2G2D2N                      1499
#define CLC2GLS1_D2T                  1500
#define LC2G2D2T                      1501
#define LC2G2D3N                      1502
#define CLC2GLS1_D3N                  1503
#define LC2G2D3T                      1504
#define CLC2GLS1_D3T                  1505
#define LC2G2D4N                      1506
#define CLC2GLS1_D4N                  1507
#define LC2G2D4T                      1508
#define CLC2GLS1_D4T                  1509
#define CLC2GLS2                      1510
#define LC2G3D1N                      1511
#define CLC2GLS2_D1N                  1512
#define CLC2GLS2_D1T                  1513
#define LC2G3D1T                      1514
#define CLC2GLS2_D2N                  1515
#define LC2G3D2N                      1516
#define LC2G3D2T                      1517
#define CLC2GLS2_D2T                  1518
#define CLC2GLS2_D3N                  1519
#define LC2G3D3N                      1520
#define CLC2GLS2_D3T                  1521
#define LC2G3D3T                      1522
#define CLC2GLS2_D4N                  1523
#define LC2G3D4N                      1524
#define LC2G3D4T                      1525
#define CLC2GLS2_D4T                  1526
#define CLC2GLS3                      1527
#define LC2G4D1N                      1528
#define CLC2GLS3_G4D1N                1529
#define CLC2GLS3_G4D1T                1530
#define LC2G4D1T                      1531
#define CLC2GLS3_G4D2N                1532
#define LC2G4D2N                      1533
#define LC2G4D2T                      1534
#define CLC2GLS3_G4D2T                1535
#define CLC2GLS3_G4D3N                1536
#define LC2G4D3N                      1537
#define CLC2GLS3_G4D3T                1538
#define LC2G4D3T                      1539
#define LC2G4D4N                      1540
#define CLC2GLS3_G4D4N                1541
#define CLC2GLS3_G4D4T                1542
#define LC2G4D4T                      1543
#define CLC3CON                       1544
#define LC3MODE0                      1545
#define CLC3CON_MODE0                 1546
#define CLC3CON_MODE                  1547
#define LC3MODE                       1548
#define LC3MODE1                      1549
#define CLC3CON_MODE1                 1550
#define LC3MODE2                      1551
#define CLC3CON_MODE2                 1552
#define LC3INTN                       1553
#define CLC3CON_INTN                  1554
#define CLC3CON_INTP                  1555
#define LC3INTP                       1556
#define CLC3CON_OUT                   1557
#define LC3OUT                        1558
#define LC3EN                         1559
#define CLC3CON_EN                    1560
#define CLC3POL                       1561
#define LC3G1POL                      1562
#define CLC3POL_G1POL                 1563
#define LC3G2POL                      1564
#define CLC3POL_G2POL                 1565
#define CLC3POL_G3POL                 1566
#define LC3G3POL                      1567
#define LC3G4POL                      1568
#define CLC3POL_G4POL                 1569
#define LC3POL                        1570
#define CLC3POL_POL                   1571
#define CLC3SEL0                      1572
#define CLC3SEL0_D1S0                 1573
#define LC3D1S0                       1574
#define LC3D1S                        1575
#define CLC3SEL0_D1S                  1576
#define LC3D1S1                       1577
#define CLC3SEL0_D1S1                 1578
#define LC3D1S2                       1579
#define CLC3SEL0_D1S2                 1580
#define LC3D1S3                       1581
#define CLC3SEL0_D1S3                 1582
#define LC3D1S4                       1583
#define CLC3SEL0_D1S4                 1584
#define CLC3SEL1                      1585
#define CLC3SEL1_D2S                  1586
#define CLC3SEL1_D2S0                 1587
#define LC3D2S                        1588
#define LC3D2S0                       1589
#define CLC3SEL1_D2S1                 1590
#define LC3D2S1                       1591
#define CLC3SEL1_D2S2                 1592
#define LC3D2S2                       1593
#define CLC3SEL1_D2S3                 1594
#define LC3D2S3                       1595
#define LC3D2S4                       1596
#define CLC3SEL1_D2S4                 1597
#define CLC3SEL2                      1598
#define CLC3SEL2_D3S0                 1599
#define LC3D3S                        1600
#define CLC3SEL2_D3S                  1601
#define LC3D3S0                       1602
#define LC3D3S1                       1603
#define CLC3SEL2_D3S1                 1604
#define LC3D3S2                       1605
#define CLC3SEL2_D3S2                 1606
#define LC3D3S3                       1607
#define CLC3SEL2_D3S3                 1608
#define LC3D3S4                       1609
#define CLC3SEL2_D3S4                 1610
#define CLC3SEL3                      1611
#define CLC3SEL3_D4S0                 1612
#define LC3D4S0                       1613
#define LC3D4S                        1614
#define CLC3SEL3_D4S                  1615
#define LC3D4S1                       1616
#define CLC3SEL3_D4S1                 1617
#define LC3D4S2                       1618
#define CLC3SEL3_D4S2                 1619
#define LC3D4S3                       1620
#define CLC3SEL3_D4S3                 1621
#define LC3D4S4                       1622
#define CLC3SEL3_D4S4                 1623
#define CLC3GLS0                      1624
#define CLC3GLS0_D1N                  1625
#define LC3G1D1N                      1626
#define LC3G1D1T                      1627
#define CLC3GLS0_D1T                  1628
#define LC3G1D2N                      1629
#define CLC3GLS0_D2N                  1630
#define CLC3GLS0_D2T                  1631
#define LC3G1D2T                      1632
#define CLC3GLS0_D3N                  1633
#define LC3G1D3N                      1634
#define LC3G1D3T                      1635
#define CLC3GLS0_D3T                  1636
#define CLC3GLS0_D4N                  1637
#define LC3G1D4N                      1638
#define CLC3GLS0_D4T                  1639
#define LC3G1D4T                      1640
#define CLC3GLS1                      1641
#define LC3G2D1N                      1642
#define CLC3GLS1_D1N                  1643
#define CLC3GLS1_D1T                  1644
#define LC3G2D1T                      1645
#define LC3G2D2N                      1646
#define CLC3GLS1_D2N                  1647
#define LC3G2D2T                      1648
